{
    "messages": [
        {
            "sender": "Lena",
            "text": "hey, are you still coming to dinner with my friends tonight?"
        },
        {
            "sender": "Ryan",
            "text": "I don’t know. I had a long day, kind of not in the mood for small talk."
        },
        {
            "sender": "Lena",
            "text": "that’s fine, I just already told them you’d come. they’ve been asking to meet you for weeks."
        },
        {
            "sender": "Ryan",
            "text": "why do you always make plans without checking with me first?"
        },
        {
            "sender": "Lena",
            "text": "I didn’t think it was a big deal, it’s just dinner. you usually like going out."
        },
        {
            "sender": "Ryan",
            "text": "yeah, but lately it feels like you just drag me to these things to make yourself look good."
        },
        {
            "sender": "Lena",
            "text": "what? that’s not true. I just want them to know you. they keep asking about you."
        },
        {
            "sender": "Ryan",
            "text": "you don’t get it. every time we go out, you’re glued to them and I’m just sitting there."
        },
        {
            "sender": "Lena",
            "text": "I try to include you, but sometimes you don’t even respond when they ask you stuff."
        },
        {
            "sender": "Ryan",
            "text": "maybe because the whole thing feels fake. like I’m supposed to smile and pretend everything’s fine."
        },
        {
            "sender": "Lena",
            "text": "what do you mean “pretend”? nothing’s wrong, we just haven’t had time together this week."
        },
        {
            "sender": "Ryan",
            "text": "exactly. you’re too busy with your stuff. you barely even text me during the day anymore."
        },
        {
            "sender": "Lena",
            "text": "that’s not fair, I was in meetings all morning. I told you that."
        },
        {
            "sender": "Ryan",
            "text": "I see you posting on Instagram though."
        },
        {
            "sender": "Lena",
            "text": "that was just a story from yesterday. you’re really overthinking this."
        },
        {
            "sender": "Ryan",
            "text": "maybe I wouldn’t if you actually made me feel like a priority."
        },
        {
            "sender": "Lena",
            "text": "Ryan, that’s not fair. you know how much I care about you."
        },
        {
            "sender": "Ryan",
            "text": "sometimes I wonder. I feel like I’m the only one trying lately."
        },
        {
            "sender": "Lena",
            "text": "that’s not true at all. I’ve been trying to plan things, like tonight."
        },
        {
            "sender": "Ryan",
            "text": "see, that’s what I mean. you think “planning things” fixes everything. it’s not about that."
        },
        {
            "sender": "Lena",
            "text": "then what is it about?"
        },
        {
            "sender": "Ryan",
            "text": "it’s about effort. consistency. you saying you care but acting like you don’t."
        },
        {
            "sender": "Lena",
            "text": "I can’t always be available every second, I have work too."
        },
        {
            "sender": "Ryan",
            "text": "yeah, you always have an excuse."
        },
        {
            "sender": "Lena",
            "text": "that’s not an excuse, it’s just reality."
        },
        {
            "sender": "Ryan",
            "text": "whatever. go to your dinner. I’ll just stay home. I don’t want to ruin your perfect night."
        },
        {
            "sender": "Lena",
            "text": "that’s not what I want. I wanted you there."
        },
        {
            "sender": "Ryan",
            "text": "you say that now, but you’ll probably have more fun without me anyway."
        },
        {
            "sender": "Lena",
            "text": "please don’t do this again. it feels like every time I try, you find something wrong."
        },
        {
            "sender": "Ryan",
            "text": "because I actually care, Lena. I notice when you pull away. you just don’t get it."
        },
        {
            "sender": "Lena",
            "text": "I do get it. I just wish you trusted me more instead of assuming the worst."
        },
        {
            "sender": "Ryan",
            "text": "maybe if you acted like you actually wanted me around, I wouldn’t have to."
        },
        {
            "sender": "Lena",
            "text": "I can’t keep proving myself every time we disagree."
        },
        {
            "sender": "Ryan",
            "text": "see? now you’re making me the bad guy again."
        },
        {
            "sender": "Lena",
            "text": "I’m not. I just want us to talk without turning everything into a fight."
        },
        {
            "sender": "Ryan",
            "text": "I’m done talking. goodnight."
        },
        {
            "sender": "Lena",
            "text": "…okay. goodnight."
        }
    ]
}